models/Offers.php

	public static function getAll()
	{
		$data = self::find()->all();
---
SELECT * FROM `offers`